[
  {
    "id": "covid-data-status",
    "title": "Ithaca Covid Status Dashboard",
    "subtitle": "Displaying dynamic Covid data for an at-a-glance look at the most important numbers.",
    "category": "Web App",
    "demo": "https://ithaca-covid-status.vercel.app/",
    "code": "https://github.com/kieracarman/ithaca-covid-status",
    "description": [
      "This minimalistic app fetches covid data from the Tompkins County Health Department and parses out the most important numbers to show the general status of covid risk in the area.",
      "I created this app because I felt like the health department's website was too complicated, and I wanted a super quick overview of the community transmission and case data to guage infection risk in real time.",
      "I wrote an API route that uses Axios to fetch CSV data from a public Google Sheet updated by the health department, then return the important data as JSON which is then displayed on the page. This project utilizes the server-side rendering built in to Next.js to serve fully rendered content to the client."
    ]
  },
  {
    "id": "studio-manager",
    "title": "SRT Studio Management Platform",
    "subtitle": "A web app management platform for a university sound recording technology department.",
    "category": "Web App",
    "code": "https://github.com/kieracarman/srt-studio-manager",
    "description": [
      "This web app is one of my work-in-progress projects.",
      "I developed this concept while chatting with my dad, who manages sound recording facilities at a university. He expressed a need for a management platform, to assist with his responsibilities including keeping track of physical and non-physical assets, studio bookings, and managing support requests when things break or go missing.",
      "The scope of this project includes multiple RESTful APIs to manage all of the different data involved, as well as integration with the university's Active Directory to enable students and faculty to log in with their SSO .edu email address and password."
    ]
  },
  {
    "id": "inventory",
    "title": "Inventory Management System",
    "subtitle": "A simple inventory management web app to keep track of ingredients in a donut shop.",
    "category": "Web App",
    "code": "https://github.com/kieracarman/donut-ims",
    "description": [
      "I designed and implemented this app to solve a logistics issue for a donut shop.",
      "The kitchen kept running out of important ingredients when they needed them most, and had a hard time remembering when to reorder commonly-used ingredients.",
      "The web application I designed is responsive and 100% mobile compatible. It allows staff members to take inventory snapshots so they always know what is on the shelves, and automates the process of reordering items when their stock drops below a preset threshold."
    ]
  }
]
